// ---------------------------------- State Mangament ------------------------------------------- //

/*
    State Management - это доступ к компоненетом имеяя наивысшый уровень состояния.

    При использовании props в вложенных проектах , вызов props усложняется и приходится
    применить state management.
*/

// Сушествует три популярные вида state management:
/*
    1. context - собственный хук React та. используется для маленких проектах.
    2. zustand - библиотека для state management используется для средних проектах.
    3. redux toolkit - библиотека для state management используется для enterprise приложений.
*/

