//  --------------------------  React JS  ---------------------------------- // 

/*
    React - это библиотека js но из за широково применения он используется как фреймворк.
    React - подерживает SAP ( Single Page pplication ) навигация происходит только в одной странице.
    React - дает нам возможность периспользовать компоненты.
    React - был разработан команией Facebook.
    React - создает Virtual Dom который различается от реального дома. Virtual Dom сначала переренедрится
    а потом изменяет в реальный дом тот часть который был изменен.
*/
